app/controllers/imports_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."name" = 'Cocobambu' LIMIT 1
UPDATE "menus" SET "restaurant_id" = $1, "updated_at" = $2 WHERE "menus"."id" = 17  [["restaurant_id", 1], ["updated_at", "2014-10-02 20:19:52.210340"]]
---
	def menu
    restaurant = Restaurant.find_by(name: params[:restaurant_name])
    if restaurant
      menu_items = Menu.import(params[:menu_file])
      menu_items.each { |item| item.update(restaurant_id: restaurant.id) }