app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menus = Menu.all

SELECT  "menus".* FROM "menus"  WHERE "menus"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @menu = Menu.find(params[:id])

DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 2]]
---
  def destroy
    @menu.destroy

SELECT  "menus".* FROM "menus"  WHERE "menus"."id" = $1 LIMIT 1  [["id", 7]]
---
    def set_menu
      @menu = Menu.find(params[:id])