app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.all

SELECT  "menus".* FROM "menus"  WHERE "menus"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 1]]
---
  def show
    @menu = @restaurant.menus.select { |menu| menu.status == "current" }.first

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])